backend/stress-test.yml
config:
  target: "http://localhost:3000"
  plugins:
    ensure: {}
  phases:
    - duration: 20
      arrivalRate: 5
      name: "1. Fase de calentamiento"
    - duration: 30
      arrivalRate: 15
      rampTo: 50
      name: "2. Fase de saturacion maxima"
  ensure:
    thresholds:
      - "http.response_time.p99": 200
    maxErrorRate: 1

scenarios:
  - name: "Inundacion transaccional perimetral con payloads mixtos Zod"
    flow:
      - post:
          url: "/api/v1/employees"
          json:
            nombre: "Andres Mendoza"
            cargo: "Software Architect"
            departamento: "I+D"
            sueldo: 4200
          capture:
            - json: "$.data._id"
              as: "employeeId"
      - think: 1
      - post:
          url: "/api/v1/employees"
          json:
            nombre: "Al"
            cargo: "Dev"
            departamento: "TI"
            sueldo: -500